package sengoku_conquest.const_values;

/**
 * Created by Yamamoto on 2016/12/02.
 * 固定文字を入れるところ
 */
public class Strings {
    final static String story = "　主人公は激怒した。必ず、かの邪智暴虐の魔王を除かなければならぬと決意した。主人公には政治がわからぬ。けれども邪悪に対しては、人一倍に敏感であった。\n" +
            "　主人公は内気な妹と二人暮しだ。この妹は結婚式も間近なのである。それゆえ、今日未明主人公は村を出発し、花嫁の衣裳やら祝宴の御馳走やらを買いに3マスはなれた此の京の都にやって来た。\n" +
            "\n" +
            "　主人公には竹馬の友があった。今は此の都に住んでいる。その友を、訪ねてみるつもりなのだ。歩いているうちに主人公は、都の様子を怪しく思った。もう既に日も落ちて、暗いのは当りまえだが、夜のせいばかりでは無く、都全体がやけに寂しい。暢気な主人公も、段々と不安になって来た。\n" +
            "\n" +
            "　路で逢った老爺をつかまえて、何かあったのか、前に都に来たときは、夜でも賑やかであった筈だが、主人公は語勢を強くして質問した。老爺は、わずか答えた。\n" +
            "「魔王様は、人を殺します。」\n" +
            "「なぜ殺すのだ。」\n" +
            "「悪心を抱いている、というのですが、誰も悪心を持っては居りませぬ。」\n" +
            "「たくさんの人を殺したのか。」\n" +
            "「はい、はじめは魔王様の妹婿さまを。それから、御自身のお世嗣、妹さまと妹さまの御子さま、皇后さまを。それから、賢臣の明智光秀様を。」\n" +
            "「驚いた。魔王は乱心か。」\n" +
            "「いいえ、乱心ではございませぬ。人を信ずる事が出来ぬ、と言うのです。今日は、六人殺されました。」聞いて、主人公は激怒した。\n" +
            "「呆れた魔王だ。生かして置けぬ。」\n" +
            "\n" +
            "　主人公は、単純な男であった。のそのそ魔王城にはいって行った。たちまち巡邏の警吏に捕縛され、主人公は、魔王の前に引き出された。\n" +
            "「何をするつもりであったか。言え！」\n" +
            "「第六天魔王　織田信長」は静かに、けれども威厳を以て問いつめた。\n" +
            "「都を魔王の手から救うのだ。」と主人公は悪びれずに答えた。\n" +
            "「お前がか？」魔王は、憫笑した。「仕方の無いやつじゃ。おまえには、わしの孤独がわからぬ。」\n" +
            "主人公は、いきり立って反駁した。「言うな！人の心を疑うのは、最も恥ずべき悪徳だ。」\n" +
            "「疑うのが、正当の心構えなのだ。人の心は、あてにならない。信じては、ならぬ。」\n" +
            "魔王は落着いて呟き、ほっと溜息をついた。「わしだって、平和を望んでいるのだが。」\n" +
            "「なんの為の平和だ。」今度は主人公が嘲笑した。\n" +
            "「罪の無い人を殺して、何が平和だ。」\n" +
            "「だまれ、下賤の者。口では、どんな清らかな事でも言える。お前だって、磔になってから、泣いて詫びたって聞かぬぞ。」\n" +
            "「ああ、魔王は悧巧だ。自惚れているがよい。私は、ちゃんと死ぬる覚悟で居るのに。命乞いなど決してしない。ただ、――」主人公は瞬時ためらい、「ただ、私に情をかけたいつもりなら、処刑までに20ターンの限を与えて下さい。たった一人の妹に、亭主を持たせてやりたいのです。必ず、ここへ帰って来ます。」\n" +
            "\n" +
            "　「ばかな。」と魔王は、嗄れた声で低く笑った。「とんでもない嘘を言うわい。逃がした小鳥が帰って来るというのか。」\n" +
            "「そうです。帰って来るのです。私は約束を守ります。私を、三日間だけ許して下さい。そんなに私を信じられないならば、よろしい、この市に竹馬の友がいます。私の無二の友人だ。人質としてここに置いて行こう。私が20ターン目の日暮まで、ここに帰って来なかったら、あの友を絞め殺して下さい。」\n" +
            "\n" +
            "　それを聞いて魔王は、そっと北叟笑んだ。生意気なことを言うわい。どうせ帰って来ないにきまっている。騙された振りして、放してやるのも面白い。そうして身代りの友を、20ターン目に殺してやるのも気味がいい。\n" +
            "「願いを、聞いた。その身代りを呼ぶがよい。20ターン目の日没までに帰って来い。遅れたら、その身代りを、きっと殺すぞ。ちょっと遅れて来るがいい。おまえの罪は、永遠にゆるしてやろうぞ。」\n" +
            "「何をおっしゃる。」\n" +
            "「はは。命が大事だったら、遅れて来い。お前の心は、わかっているぞ。」\n" +
            "主人公は地団駄踏んだ。ものも言いたくなくなった。\n" +
            "\n" +
            "　竹馬の友は、深夜、王城に召された。「第六天魔王　織田信長」の面前で、友と友は、二年ぶりで相逢うた。主人公は、友に一切の事情を語った。友は無言で首肯き、主人公をひしと抱きしめた。友と友の間は、それでよかった。竹馬の友は、縄打たれた。主人公は、すぐに出発した。初夏、満天の星である。";

    final static String rule = "ルール\n" +
            "竹馬の友のために織田信長を倒そう\n" +
            "日本を旅して大名を倒しレベルを上げよう\n" +
            "大名は織田信長を含め9人いるぞ\n" +
            "レベル4にならないと織田信長に挑めないぞ\n" +
            "戦闘に敗北もしくはターンが0になると敗北するので気をつけよう\n" +
            "\n" +
            "コマンド説明\n" +
            "移動コマンド\n" +
            "　移動　1ターン消費しマップの隣り合うマス東西南北に1マス移動\n" +
            "　休憩　1ターン消費しHP30回復\n" +
            "　ステータスを表示する　主人公のステータスを表示" +
            "　アイテム使用　アイテムを使用\n" +
            "\n" +
            "戦闘コマンド\n" +
            "　通常攻撃　ATK値攻撃\n" +
            "　特殊攻撃　EPを1消費する攻撃\n" +
            "　逃走　　　1ターン消費し1マス戻る(織田信長以外は必ず逃げられる)\n" +
            "\n" +
            "アイテム説明\n" +
            "　握り飯　HP50回復\n" +
            "　いにしえの秘薬　EP3回復\n" +
            "　※回復は最大値を超えることはない\n" +
            "\n" +
            "職業説明\n" +
            "　侍　level1 HP105 ATK50 DEF30 EP3\n" +
            "　　　特技：居合切り\n" +
            "　　　通常攻撃の1.45倍ダメージ\n" +
            "\n" +
            "　忍者　level1 HP85 ATK60 DEF30 EP2\n" +
            "　　　特技：変わり身の術\n" +
            "　　　通常攻撃の0.8倍ダメージ、次の攻撃のダメージを受けない\n" +
            "\n" +
            "　足軽　level1 HP110 ATK40 DEF45 EP4\n" +
            "　　　特技：一揆\n" +
            "　　　通常攻撃ダメージ、次の敵攻撃時反撃(自分が受けたダメージを与える)\n" +
            "\n" +
            "　虚無僧　level1 HP90 ATK45 DEF30 EP4\n" +
            "　　　特技：吸魂\n" +
            "　　　通常攻撃の1.2倍ダメージ、減らした体力分回復\n" +
            "\n" +
            "ヒント\n" +
            "　主人公は最大レベル6まで強化できる\n" +
            "　HP回復アイテムは3つあるぞ\n" +
            "　敵のレベルが自分のレベルより2つ高いと敵に勝つのは難しいぞ\n" +
            "　織田信長は体力が低くなると特殊攻撃を使うので注意が必要だ";

    public static final String ANVISIBLE_CHARACTER=" ";
}
