package sengoku_conquest.const_values;

/**
 * Created by Yamamoto on 2016/12/02.
 * 固定文字を入れるところ
 */
public class Strings {
    final static String story = "ルール\n" +
            "友のために織田信長を倒そう\n" +
            "日本を旅して大名を倒しレベルを上げよう\n" +
            "大名は織田信長を含め9人いる\n" +
            "レベル4にならないと織田信長に挑めない\n" +
            "ターンが0になると敗北\n" +
            "\n" +
            "コマンド説明\n" +
            "移動コマンド\n" +
            "　移動　1ターン消費しマップの隣り合うマス東西南北に1マス移動\n" +
            "　休憩　1ターン消費しHP30回復\n" +
            "　ステータスを表示する　主人公のステータスを表示" +
            "　アイテム使用　アイテムを使用\n" +
            "\n" +
            "戦闘コマンド\n" +
            "　通常攻撃　ATK値攻撃\n" +
            "　特殊攻撃　EPを1消費する攻撃\n" +
            "　逃走　　　1ターン消費し1マス戻る(織田信長以外は必ず逃げられる)\n" +
            "\n" +
            "アイテム説明\n" +
            "　握り飯　HP50回復\n" +
            "　いにしえの秘薬　EP3回復\n" +
            "　*回復は最大値を超えることはない\n" +
            "\n" +
            "職業説明\n" +
            "　侍　level1 HP105 ATK50 DEF30 EP3\n" +
            "　　　特技：居合切り\n" +
            "　　　通常攻撃の1.45倍ダメージ\n" +
            "\n" +
            "　忍者　level1 HP85 ATK60 DEF30 EP2\n" +
            "　　　特技：変わり身の術\n" +
            "　　　通常攻撃の0.8倍ダメージ、次の攻撃のダメージを受けない\n" +
            "\n" +
            "　足軽　level1 HP110 ATK40 DEF45 EP4\n" +
            "　　　特技：一揆\n" +
            "　　　通常攻撃ダメージ、次の敵攻撃時反撃(自分が受けたダメージを与える)\n" +
            "\n" +
            "　虚無僧　level1 HP90 ATK45 DEF30 EP4\n" +
            "　　　特技：吸魂\n" +
            "　　　通常攻撃の1.2倍ダメージ、減らした体力分回復\n" +
            "\n" +
            "ヒント\n" +
            "　主人公は最大レベル6まで強化できる\n" +
            "　HP回復アイテムはマップに3つある\n" +
            "　敵のレベルが自分のレベルより2つ高いと敵に勝つのは難しい\n" +
            "　織田信長は体力が低くなると特殊攻撃を使うぞ";

}
